Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: I have to go to sleep.
hi: मुझे सोना है।

source: Muiriel is 20 now.
hi: म्यूरियल अब बीस साल की हो गई है।

source: The password is "Muiriel".
hi: कूटशब्द "Muriel" है।

source: I will be back soon.
hi: मैं जल्द लौटूंगी।

source: I'm at a loss for words.
hi: मैं तो लाजवाब हो गयी हूँ।

source: This is never going to end.
hi: यह तो कभी खत्म न होगा।

source: I just don't know what to say.
hi: मुझे नहीं पता मैं क्या कहूँ।

source: That was an evil bunny.
hi: वह ख़रगोश दुष्ट था।

source: Education in this world disappoints me.
hi: मैं इस दुनिया में शिक्षा पर बहुत निराश हूँ।

source: That won't happen.
hi: वैसा नहीं होगा।

source: I miss you.
hi: मुझें तुम्हारी याद आ रही है।

source: You should sleep.
hi: तुम्हें सोना चाहिए।

source: I never liked biology.
hi: मुझे जीव विज्ञान कभी भी पसंद नहीं था।

source: No I'm not; you are!
hi: मैं नहीं हूँ, तुम हो!

source: That's MY line!
hi: वह तो मेरी लाईन है!

source: Are you sure?
hi: पक्का?

source: Hurry up.
hi: जल्दी करो!

source: It doesn't surprise me.
hi: इससे मुझें आश्चर्य नहीं होता।

source: For some reason I feel more alive at night.
hi: पता नहीं क्यों मुझे रात में ज़्यादा ज़िन्दा महसूस होता है।

source: I'm so fat.
hi: मैं कितना मोटा हूं।

source: So what?
hi: तो क्या?

source: That's because you're a girl.
hi: इसलिए क्योंकि तुम लड़की हो।

source: I didn't like it.
hi: मुझे अच्छा नहीं लगा।

source: You can do it.
hi: तुम कर सकते हो।

source: That wasn't my intention.
hi: मेरा वह इरादा नहीं था।

source: It seems interesting to me.
hi: मुझे बहुत मज़ेदार लगती है!

source: What did you answer?
hi: तुमने क्या जवाब दिया?

source: Where is the problem?
hi: मुश्किल क्या है?

source: I love you.
hi: मैं तुमसे प्यार करती हूँ।

source: Congratulations!
hi: बधाई हो!

source: Why don't you come visit us?
hi: तुम हमसे मिलने क्यों नहीं आते?

source: I didn't want this to happen.
hi: मैं नहीं चाहता था कि ऐसा हो।

source: Bearing can be unbearable.
hi: बर्दाश्त की भी हद होती है।

source: Tomorrow, he will land on the moon.
hi: कल वह चाँद पर उतरेगा।

source: "When will you be back?" "It all depends on the weather."
hi: "कब वापस आओगे?" "यह तो मौसम देख कर पता चलेगा।"

source: "What's the matter?" asked the little white rabbit.
hi: "क्या बात है?" छोटे सफ़ेद खरगोश ने पूछा।

source: Allen is a poet.
hi: ऐलन कवि है।

source: Democracy is the worst form of government, except all the others that have been tried.
hi: लोकतंत्र सरकार का सबसे घिनौना रूप है, अगर बाकी सारी तरह की सरकारों को अंदेखा किया जाए तो।

source: When I left the train station, I saw a man.
hi: मैंने ट्रेन स्टेशन से निकलने के समय एक आदमी को देखा।

source: Did you miss me?
hi: मेरी याद आई क्या?

source: Thank you very much!
hi: आपका बहुत बहुत धन्यवाद!

source: I'll take him.
hi: मैं उसे लेलूँगा।

source: They say love is blind.
hi: कहते हैं कि प्यार अंधा होता है।

source: It's impossible for me to explain it to you.
hi: मुझे तुमको यह बात समझाना नामुमकिन है।

source: It is already eleven.
hi: ग्यारह बज चुके हैं।

source: I have a bone to pick with you.
hi: मैं तुमसे खुश नहीं हूँ।

source: The world is a den of crazies.
hi: दुनिया पागलों से भरी हुई है।

source: My name is Jack.
hi: मेरा नाम जैक है।

source: Would you like to dance with me?
hi: मेरे साथ नाचना चाहोगी क्या?

source: Italy is a very beautiful country.
hi: इटली एक बहुत सुंदर देश है।

source: Open your mouth!
hi: अपना मूँह खोलो!

source: Nobody came.
hi: कोई नहीं आया।

source: I'm tired.
hi: मैं थक गया हूँ।

source: I have a headache.
hi: मेरे सिर में दर्द हो रहा है।

source: It's too expensive!
hi: बहुत महंगा है!

source: Merry Christmas!
hi: क्रिसमस की शुभकामनाएँ!

source: You should have listened to me.
hi: तुम्हे मेरी बात सुन लेनी चाहिए थी।

source: I'm starving!
hi: मैं भूख से मरा जा रहा हूँ।

source: I am married and have two children.
hi: मैं शादीशुदा हूँ और मेरे दो बच्चे हैं।

source: The car crashed into the wall.
hi: गाड़ी दीवार से टकराई।

source: Who searches, finds.
hi: जो ढूँढता है, उसीको मिलता है।

source: I don't think, therefore I am not.
hi: मैं सोचता नहीं, अतः मैं नहीं हूं।

source: I find foreign languages very interesting.
hi: मेरे ख़याल से विदेशी भाषाएँ बहुत ही दिलचस्प होतीं हैं।

source: It's cold.
hi: ठंड हो रही है।

source: When you can't do what you want, you do what you can.
hi: जब वह नहीं कर सकते जो करना चाह्ते हो, तो वह करो जो कर सकते हो।

source: You didn't tell him anything?
hi: तुमने उसे कुछ भी नहीं बताया?

source: You made me lose my mind.
hi: तुमने मुझे पागल कर दिया।

source: Could you call again later, please?
hi: क्या आप थोड़ी देर बाद फिरसे फ़ोन कर सकतें हैं?

source: I don't want to go to school.
hi: मैं स्कुल जाना नहीं चाहता हूँ।

source: Justice is expensive.
hi: इंसाफ़ महंगा होता है।

source: Blind people sometimes develop a compensatory ability to sense the proximity of objects around them.
hi: कुछ नेत्रहीन व्यक्तियों में उनके आास-पास की चीज़ों की दूरी को महसूस करने की क्षतिपूरक क्षमता पैदा हो जाती है।

source: I cannot dance one single step of Salsa.
hi: मुझे साल्सा नाचना बिलकुल नहीं आता।

source: I like my job very much.
hi: मुझे अपना काम बहुत पसंद है।

source: But you've never told me about this!
hi: पर तुमने मुझे यह पहले कभी बताया नहीं था!

source: You had plenty of time.
hi: तुम्हारे पास काफ़ी समय था।

source: How many sandwiches are there left?
hi: कितने सैंडविच बचे हैं?

source: I can't believe it!
hi: मुझे विश्वास नहीं होता!

source: He's rich. He doesn't need money!
hi: वह अमीर है। उसे पैसों की ज़रूरत नहीं है।

source: He's sleeping like a baby.
hi: वह बच्चे की तरह सो रहा है।

source: There's a secret path on the left.
hi: बाईं ओर को एक गुप्त रास्ता है।

source: Are you saying my life is in danger?
hi: क्या तुम कह रहे हो कि मेरी जान ख़तरे में है?

source: So what if I am gay? Is it a crime?
hi: तो क्या अगर मैं गे हूँ? कोई अपराध है क्या?

source: I spent the whole afternoon chatting with friends.
hi: मैंने दोपहरभर अपने दोस्तों से गप मारी।

source: Sir, you are not allowed to park your car here.
hi: आप अपनी गाड़ी यहाँ खड़ी नहीं कर सकते हैं।

source: When I was your age, Pluto was a planet.
hi: जब में तुम्हारी उम्र का था तब प्लूटो ग्रह था।

source: If I don't do it now, I never will.
hi: अगर मैं अभी नहीं करूँगा तो कभी नहीं करूँगा।

source: Perhaps you are right, I have been selfish.
hi: शायद तुम सही हो, शायद मैं स्वार्थी रहा हूँ।

source: We men are used to waiting for the women.
hi: हम मर्दों को औरतों का इंतेज़ार करने की आदत है।

source: Take good care of yourself.
hi: अपना अच्छे से ख़याल रखना।

source: Until you make peace with who you are, you'll never be content with what you have.
hi: आप जब तक अपनी हैसियत से समझौता नहीं कर लेते, आप के पास जो कुछ है उस से आप संतुष्ट नहीं रह सकेंगे।

source: Do you have a pen on you?
hi: तुम्हारे पास कलम है क्या?

source: The sooner, the better.
hi: जितना जल्दी उतना अच्छा।

source: I don't know him.
hi: मैं उसे नहीं जानता।

source: Look carefully. I'm going to show you how it's done.
hi: ग़ौर से देखा। मैं तुम्हें दिखाऊँगा कैसे किया जाता है।

source: Fifty-two per cent of British women prefer chocolate to sex.
hi: बावन प्रतिशत ब्रिटिश औरतें सेक्स से ज़्यादा चॉकलेट पसंद करती हैं।

source: He's a good person.
hi: वह अच्छा इनसान है।

source: Make yourself at home.
hi: इसको अपना घर ही समझो।

source: I'm going to take a bath.
hi: मैं नहाने जा रहा हूँ।

source: They quarreled.
hi: वे लड़े।

source: Don't forget the ticket.
hi: टिकट भूलना मत।

source: I talked to friends.
hi: मैने दोस्तों से बात की।

source: Tell me what happened.
hi: मुझे बताओ क्या हुआ।

source: It's more difficult than you think.
hi: जितना तुम सोच रहे हो उतना आसान नहीं है।

source: I don't know if I'll have time to do it.
hi: मुझे नहीं पता मेरे पास यह करने के लिए समय होगा कि नहीं।

source: Who said that? It's totally wrong!
hi: वैसा किसने कहाँ? वह तो पूरी तरह से गलत है!

source: For once in my life I'm doing a good deed... And it is useless.
hi: मैंने ज़िन्दगी में पहली बार कोई अच्छा काम किया पर वह भी बेकार निकला।

source: It's been ten years since we last met.
hi: हमारी पिछली मुलाक़ात से अब दस साल हो गए हैं।

source: I buried my dog at the pet cemetery.
hi: मैंने अपने कुत्ते को पालतू जानवरों के कब्रिस्तान में बरी कर दिया।

source: You should take care of your sick mother.
hi: तुम्हे अपनी बीमार माँ का ख़याल रखना चाहिए।

source: Can you keep a secret?
hi: तुम राज़ रख सकते हो क्या?

source: You are tired, aren't you?
hi: तुम थक गए हो, है ना?

source: Are you younger than him?
hi: तुम उससे छोटे हो क्या?

source: You must take his age into account.
hi: तुम्हे उसकी उम्र का भी लिहाज करना चाहिए।

source: All you have to do is follow his advice.
hi: तुम्हे बस उसकी सलाह के मुताबिक काम करना होगा।

source: It would be better for you not to ask him for advice.
hi: बहतर होगा कि तुम उससे सलाह न माँगो।

source: You must study hard.
hi: तुम्हें मन लगाकर पढ़ना होगा।

source: It is necessary for you to see a doctor at once.
hi: तुम्हें जल्द-से-जल्द डॉक्टर के पास जाने की ज़रूरत है।

source: Are you meeting someone here?
hi: तुम यहाँ किसी से मिल रहे हो क्या?

source: You may have read this book already.
hi: तुमने यह किताब पहले ही पढ़ी होगी.

source: Do you believe in God?
hi: क्या तुम भगवान में विश्वास करते हो?

source: You work hard.
hi: तुम मेहनत करते हो।

source: You ought not to have spent so much money on your hobby.
hi: तुम्हें अपने शौक पर इतने सारे पैसे खर्च नहीं करने चाहिए थे।

source: Can you drive a car?
hi: तुम्हें गाड़ी चलाना आता है क्या?

source: Do you have a room of your own?
hi: क्या तुम्हारे पास अपना खुद का कमरा है?

source: You had better do as I suggest.
hi: बहतर होगा कि तुम वैसा ही करो जैसा मैं बताऊं।

source: Did you go out last night?
hi: क्या तुम कल रात बाहर गए थे?

source: You look happy today.
hi: तुम आज खुश लगते हो।

source: You have to go.
hi: तुम्हें जाना होगा।

source: You should conform to the rules.
hi: तुम्हे नियमों का पालन करना चाहिए।

source: Would you like to go abroad?
hi: तुम विदेश जाना चाहती हो क्या?

source: You should have attended the meeting.
hi: तुम्हे मीटिंग में आना चाहिए था।

source: How many books do you have?
hi: तुम्हारे पास कितनी किताबें हैं?

source: What are you looking for?
hi: क्या ढूँढ रहे हो?

source: What are you going to be?
hi: तुम क्या बनोगे?

source: Did you read it at all?
hi: तुमने पूरा पढ़ लिया क्या?

source: You have only to study hard, and you will pass the test.
hi: तुम्हें टेस्ट पास करने के लिए बस मन लगाकर पढ़ना होगा।

source: You are too ready to speak ill of others.
hi: तुम हमेशा लोगों की बुराई करने को तैयार रहते हो।

source: You'll have to manufacture some kind of excuse.
hi: तुम्हें कोई-न-कोई बहाना बनाना पड़ेगा।

source: How rude of you!
hi: कितने बदतमीज़ हो तुम!

source: Why do you want to study abroad?
hi: तुम विदेश में क्यों पढ़ना चाहते हो?

source: How long will you stay here?
hi: आप यहाँ कितने दिन रहेंगे?

source: Where were you?
hi: तुम कहाँ थे?

source: How did you come to know her?
hi: तुम उसे कैसे जानते थे?

source: What have you come here for?
hi: तुम यहाँ क्यों आए हो?

source: You are to start at once.
hi: तुम्हे बिलकुल अभी निकलना होगा।

source: You owe me an apology for that.
hi: तुम्हे इस बात के लिए मुझसे माफ़ी माँगनी चाहिए।

source: You should make use of this chance.
hi: तुम्हे इस मौके का फ़ायदा उठाना चाहिए।

source: You can study here.
hi: तुम यहाँ पढ़ाई कर सकते हो।

source: Haven't you got any money?
hi: तुम्हारे पास कुछ पैसे नहीं हैं क्या?

source: When did you begin studying English?
hi: आपने अंग्रेज़ी सीखना कब शुरू किया?

source: You are always complaining.
hi: तुम हमेशा शिकायत करते रहते हो।

source: You can't go naked in this hotel.
hi: तुम इस होटेल में नंगे नहीं जा सकते।

source: Your friendship is most precious to me.
hi: तुम्हारी दोस्ती ही मेरे लिए सबसे अनमोल है।

source: Where are your eyes?
hi: तुम्हारी आँखें कहाँ हैं?

source: Your daughter is not a child anymore.
hi: तुम्हारी बेटी अब बच्ची नहीं है।

source: You have been beaten. Give in!
hi: तुम हरा दिए गए हो। हार मान भी लो।

source: It's your move.
hi: तुम्हारी चाल है।

source: Your hair is too long.
hi: तुम्हारे बाल कुछ ज़्यादा ही लम्बे हैं।

source: Mind your own business!
hi: अपने काम से काम रखो!

source: When is your birthday?
hi: आपका जन्मदिन कब है?

source: Your bicycle is similar to mine.
hi: तुम्हारी साईकल मेरी साईकल जैसी है।

source: Is your watch correct?
hi: तुम्हारी घड़ी सही है क्या?

source: Your examination results are excellent.
hi: तुम्हारे इगज़ैम के रिज़ल्ट बहुत अच्छे हैं।

source: May we accompany you on your walk?
hi: हम तुम्हारे साथ सैर करने चलें क्या?

source: You have the freedom to travel wherever you like.
hi: तुम्हारे पास जहाँ भी जाने की मर्ज़ी हो वहाँ जाने की आज़ादी है।

source: I think you're right.
hi: मेरे ख़याल से तुम सही हो।

source: You may be right.
hi: तुम शायद सही हो।

source: That is no business of yours.
hi: इसका तुमसे कोई लेना-देना नहीं है।

source: Your house needs repairing.
hi: तुम्हारे मकान को मरम्मत की ज़रूरत है।

source: Can I use your pencil?
hi: मैं तुम्हारी पेनसिल इस्तेमाल कर सकता हूँ क्या?

source: Here is your bag.
hi: यह लो, तुम्हारा बस्ता।

source: I don't agree with you.
hi: मैं तुमसे सहमत नहीं हूँ।

source: You've got nothing to complain of.
hi: तुम्हारे पास शिकायत करने के लिए को भी वजह नहीं है।

source: Didn't I tell you so?
hi: मैंने तुम्हें बताया नहीं था?

source: Who is your teacher?
hi: तुम्हारे टीचर कौन हैं?

source: Either you or I am wrong.
hi: या तुम गलत हो या मैं |

source: The success resulted from your efforts.
hi: यह कामयाबी तुम्हारे कर्मों का फल है।

source: The reason why you failed is you did not try hard enough.
hi: तुम नाकामयाब इसलिए रहे क्योंकि तुमने पूरी तरह मेहनत नहीं लगाई।

source: It makes no difference whether you agree or not.
hi: तुम मानो या न मानो, उससे कोई फ़र्क नहीं पड़ता।

source: It will not make much difference whether you go today or tomorrow.
hi: तुम आज जाओ या कल, इससे ज़्यादा फ़र्क नहीं पड़ेगा।

source: Be sure to put out the fire before you leave.
hi: जाने से पहले आग को भुजाना मत भूलना।

source: Whatever you say, I'll marry her.
hi: तुम जो भी कहो, मैं तो उससे शादी कर के ही रहूँगा।

source: I can't allow you to do that.
hi: मैं तुम्हें यह करने नहीं दे सकता।

source: You can do this with ease.
hi: तुम यह आसानी से कर सकता हो।

source: Take off your socks, please.
hi: अपने मोज़े उतारिए।

source: Your feet are swollen because your shoes are too small.
hi: तुम्हारे पैर सूज गए हैं क्योंकि तुम्हारे जूते बहुत छोटे हैं।

source: Hunger drove him to steal.
hi: भूख ने उसे चोरी करने पर मजबूर किया।

source: Karate is an art of unarmed defense.
hi: कराटे निहत्थे रक्षा की कला है।

source: We would die without air.
hi: हम हवा के बिना मर जाएँगे।

source: Without air there can be no wind or sound on the moon.
hi: वातावरण के बिना चाँद पर हवा और आवाज़ नहीं हो सकतीं।

source: Look up to the skies.
hi: आसमानों को देखो।

source: The sky is blue.
hi: आकाश नीला है।

source: The sky clouded over.
hi: आसमान बादल-बादल हो गया।

source: There are billions of stars in the sky.
hi: आकाश में कई अरब सितारे हैं।

source: You can see a lot of stars in the sky.
hi: तुम्हें आसमान में बहुत सारे सितारे दिखाई देंगे।

source: Seen from the sky, the river looked like a huge snake.
hi: आसमान से वह नदी एक विशाल सांप की तरह दिख रही थी।

source: The rich are not always happier than the poor.
hi: अमीर हमेशा गरीबों से ज़्यादा ख़ुश नहीं होते।

source: He may be rich, but he is stingy.
hi: वह अमीर है हो है पर कंजूस भी है।

source: I'm broke.
hi: मेरा दीवालिया हो चुका है।

source: There is a gold coin.
hi: सोने का सिक्का है।

source: Get out your wallet.
hi: अपना बटुआ निकालो।

source: Too much money?
hi: पैसे बहुत ज़्यादा हैं क्या?

source: A fire broke out near my house.
hi: मेरे घर के पड़ोस में आग लग गई थी।

source: Business is so slow these days.
hi: कारोबार में आजकल मंदी पड़ गई है।

source: What number should I call in case of an emergency?
hi: आपातकालीन स्तिथि में मुझे क्या नम्बर मिलाना चाहिए?

source: In case of emergency, call 119.
hi: आपातकाल में ११९ को फ़ोन करें

source: I advise you to stop smoking.
hi: मेरे ख़याल से तुम्हे सिगरेट पीना छोड़ देना चहिए।

source: You startled me!
hi: तुमने मुझे डरा दिया!

source: To my surprise, she could not answer the question.
hi: मैं हैरान था कि वह सवाल का जवाब नहीं दे पाई।

source: I feel like vomiting.
hi: मुझे उल्टी आ रही है।

source: Tom started the engine.
hi: टॉम ने इंजन को चालू कर दिया।

source: Mr Hashimoto is known to everyone.
hi: हाशिमोतो-जी को सभी जानते हैं।

source: The bridge is safe; you can drive across.
hi: ब्रिज सुरक्षित है, तुम उसपर गाड़ी चलाकर जा सकते हो।

source: Do you know the man standing on the bridge?
hi: तुम ब्रिज पर खड़े हुए आदमी को जानते हो क्या?

source: It is the students' duty to clean their classrooms.
hi: अपने कक्षालय की सफ़ाई करना विद्यार्थियों का कर्तव्य होता है।

source: Take off your hat when you enter a classroom.
hi: क्लासरूम में घुसते समय अपनी टोपी उतारा करो।

source: You must not forget your schoolbooks.
hi: तुम्हे अपनी पाठशाला की पुस्तकें नहीं भूलनी चाहिए।

source: There are many old temples in Kyoto.
hi: क्योटो में बहुत सारे पुराने मंदिर हैं।

source: How is it going in the fish market?
hi: मछली बाज़ार में कैसा चल रहा है?

source: Fish, please.
hi: मछली, कृप्या।

source: Fish live in the water.
hi: मछलियाँ पानी में जीतीं हैं।

source: Fish live in the sea.
hi: मछलियाँ समुंदर में रहतीं हैं।

source: I'm allergic to fish.
hi: मुझे मछली से एलर्जी है।

source: The fisherman exaggerated the size of the fish he had caught.
hi: मछवारे ने पकड़ी हुई मछली के आकार को बढ़ा-चढ़ाकर बताया।

source: Is there a milkman?
hi: दूधवाला है?

source: I bought two bottles of milk.
hi: मैंने दूध की दो बोतलें ख़रीदीं।

source: I ran into an old friend.
hi: मेरी एक पुराने दोस्त से मुलाक़ात हुई।

source: Misfortunes never come singly.
hi: मुसीबत अकेले नहीं आती।

source: Rub salt in the wound.
hi: जले पर नमक छिड़कना।

source: Do you need an ambulance?
hi: आपको ऐमब्यूलेंस की ज़रूरत है क्या?

source: Hurry, and you will catch the train.
hi: जल्दी करो तो ट्रेन पकड़ सकते हो।

source: Hurry up, and you can catch the train.
hi: जल्दी करोगे तो अभी भी ट्रेन पकड़ सकते हो।

source: Hurry up, or you'll miss the bus.
hi: जल्दी करो नहीं तो बस छूट जाएगी।

source: You make mistakes if you do things in a hurry.
hi: जल्दबाज़ी में काम करोगे तो ग़लतियाँ तो होंगीं ही।

source: Please hurry.
hi: जल्दी करो।

source: I haven't seen him for a long time.
hi: मैंने उसे बहुत दिनों से नहीं देखा है।

source: Smoking will do you a lot of harm.
hi: धूम्रपान आपको हानि पहुँचाएगा।

source: What is the difference between imitation and real diamonds?
hi: असली और नकली हीरों में क्या फ़र्क होता है?

source: What is done cannot be undone.
hi: होनी को अनहोनी नहीं किया जा सकता।

source: You tried.
hi: तुमने कोशिश की।

source: You drink tea.
hi: तुम चाय पीते हो।

source: Reporter: Did you buy her a kitten?
hi: रिपोर्टर: क्या आपने उसके लिए बिल्ली खरीदी थी?

source: Our train stopped suddenly.
hi: हमारी ट्रेन अचानक रुक गई।

source: Please make yourself at home.
hi: इसको अपना घर ही समझो।

source: What's the temperature?
hi: तापमान क्या है?

source: Take care.
hi: अपना ध्यान रखना।

source: I fainted.
hi: मैं बेहोश हो गया।

source: Never mind!
hi: कोई बड़ी बात नहीं है!

source: You can go home if you like.
hi: चाहो तो घर जा सकते हो।

source: Keep sight of the flag.
hi: झंडे को नज़र में रखना।

source: A book is lying on the desk.
hi: मेज़ पर एक किताब पड़ी हुई है।

source: There is a book on the desk.
hi: मेज़ पर किताब है।

source: There is a bag on the desk.
hi: मेज़ पर बस्ता रखा हुआ है।

source: There is a cat under the desk.
hi: मेज़ के नीचे एक बिल्ली है।

source: I agree with you to a degree.
hi: मैं तुम्हारे साथ एक हद तक सहमत हूँ।

source: Don't give up hope.
hi: उम्मीद मत छोड़ो।

source: Strange as it may sound, this is true.
hi: चाहे सुनने में जितना भी अजीब लगे, यह सच है।

source: I will be pleased to help you.
hi: मुझे आपकी मदद करके खुशी होगी।

source: Turn your face this way.
hi: अपना मूँह इस ओर मोड़ो।

source: I try.
hi: मैं कोशिश करता हूँ।

source: I don't exist to you.
hi: मैं तुम्हारी आँखों में मर चुका हूँ।

source: I've lost my glasses.
hi: मेरा चश्मा खो गया है।

source: Cancer can be cured if discovered in time.
hi: कैंसर का अगर समय में पता चल जाए, तो उसका इलाज हो सकता है।

source: It's as deep as it is wide.
hi: जितना गहरा है, उतना ही चौड़ा है।

source: Don't be afraid of making mistakes.
hi: ग़लतियाँ करने से मत डरो।

source: We ought to do our best not to pollute our environment.
hi: हमे पर्यावरण के प्रदूषण को रोकने का प्रयास करना चाहिए।

source: Kanji are difficult to read.
hi: चीनी अक्षर पढ़ने में मुश्किल होते हैं।

source: The patient was lying in the bed with his eyes closed.
hi: मरीज़ आँखें बंद कर बिस्टर पर लेटा हुआ था।

source: Check, please.
hi: चेक, कृप्या।

source: I feel cold. Do you mind closing the window?
hi: मुझे ठंड लग रही है। खिड़की बंद कर सकते हो क्या?

source: Have fun.
hi: मज़े करना।

source: Have a nice time.
hi: मज़े करो।

source: Have a good time.
hi: मज़े करो।

source: Enjoy yourself!
hi: मज़े करो।

source: It's been nice talking to you, but I really must go now.
hi: आपसे बात करके खुशी हुई, पर अब मुझे जाना पड़ेगा।

source: Not all the students were present at the class.
hi: कक्षा में सभी विद्यार्थी उपस्थित नहीं थें।

source: The students assisted the professor in the investigation.
hi: छात्रों ने प्रोफेसर की तहकीकात में सहायता करी।

source: School begins in April.
hi: स्कूल अप्रैल में शुरू होता है।

source: School begins at eight-thirty.
hi: स्कूल साढ़े-आठ बजे शुरू होता है।

source: The more we learn, the better we realize our ignorance.
hi: जितना ज़्यादा हम सीखते हैं, उतना हि बहतर हमें हमारी अज्ञानता का अहसास होता है।

source: After the revolution, France became a republic.
hi: क्रांति के बाद, फ़्रांस एक गणतंत्र बना।

source: There's a pub just around the corner.
hi: बस उस कोने के आगे ही एक मदिरालय है।

source: I'm sure I've seen him before.
hi: मुझे यकीन है कि मैंने उसे पहले देखा हुआ है।

source: Each member has to pay a membership fee.
hi: हर सदस्य को सदस्यता शुल्क भरना होगा।

source: If you shout from the top of a cliff, you can hear the echo of your voice.
hi: अगर तुम ऊँची चट्टान पर जाकर चिल्लाओ तो अपनी आवाज़ की गूँज सुन सकते हो।

source: Make sure to turn off all the lights before going out.
hi: बहार जाने से पहले सारी बत्तियाँ बंद करना मत भूलना।

source: I would rather stay at home than go out.
hi: मुझे बाहर जाने से घर में रहना पसंद है।

source: Didn't you go out?
hi: आप बाहर नहीं गए थें क्या?

source: It is often said that the best way to learn a foreign language is to go to the country where it is spoken.
hi: अक्सर कहा जाता है कि किसी भी विदेशी भाषा को सीखने का सबसे अच्छा तरीका उस देश में जाकर रहना होता है।

source: Learning a foreign language is fun.
hi: विदेषी भाषा सीखना बहुत मज़ेदार होता है।

source: Have you been abroad?
hi: आप विदेश गए हुए हैं क्या?

source: Everybody came to the class on time.
hi: सभी लोग क्लास में समय पर पहुँचे।

source: How is everyone?
hi: सब लोग कैसे हैं?

source: Everybody laughed.
hi: सभी हसे।

source: It is never too late to mend.
hi: सवेरे का भूला साँझ को घर आ जाए तो भूला नहीं कहलाता ।

source: Cover up the injured man with this blanket.
hi: घायल आदमी को इस कंबल से ढक दो।

source: Cross off the names of the people who have paid their dues.
hi: जो पैसे भर चुकें हैं, उनके नाम काट दो।

source: Management of a company is different from ownership of a company.
hi: किसी कम्पनी को चलाना उसके मालिक बनने से फ़र्क होता है।

source: Fix a date for the meeting.
hi: मीटिंग के लिए तारीख पक्की करो।

source: How many people were present at the meeting?
hi: बैठक मैं कितने लोग मौजूद थे ?

source: We gave our mother a watch.
hi: हमने हमारी मां को एक घड़ी दी।

source: We accepted his offer.
hi: हमने उसके प्रस्ताव को स्वीकार कर लिया।

source: We shared the profit among us all.
hi: हमने मुनाफ़े को अपने बीच बाँटा।

source: We are against war.
hi: हम जंग के ख़िलाफ़ हैं।

source: We should observe the speed limit.
hi: हमे गति सीमा का पालन करना चाहिए।

source: We are anxious for world peace.
hi: हम विश्व शांति के लिए तत्पर हैं।

source: We are firmly confident of victory.
hi: हमको अपनी जीत का पूरा यकीन है।

source: We must abide by the rules of the game.
hi: हमे खेल के नियमों का पालन करना पड़ेगा।
